{"text": "Qual o tempo de forno para um bolo de cenoura tradicional? Asse por 35–40 min em forno preaquecido a 180 °C e faça o teste do palito aos 30 min.  "}
{"text": "Quanto tempo devo pré‑aquecer o forno para assar biscoitos? Em geral 10 min a 180 °C já garantem temperatura estável para biscoitos.  "}
{"text": "Posso substituir fermento químico por bicarbonato de sódio? Sim, mas adicione um ácido (ex.: suco de limão ou iogurte). Use ¼ de colher de bicarbonato para cada colher de fermento e ajuste o líquido.  "}
{"text": "Por que meu pão não cresce? Fermento vencido, água muito quente ou tempo de fermentação curto podem impedir o crescimento; mantenha a massa em ambiente morno por 1–2 h.  "}
{"text": "Como evitar que o topo do bolo rache? Asse em temperatura mais baixa (160–170 °C) e use forma de alumínio clara; excesso de fermento também causa rachaduras.  "}
{"text": "Como faço para deixar a casca do pão crocante? Coloque uma assadeira com água quente no forno para gerar vapor nos primeiros 10 min de assar.  "}
{"text": "Qual a diferença entre fermento biológico seco e fresco? O seco tem menos umidade, dura mais e equivale a ⅓ do peso do fresco.  "}
{"text": "Posso usar farinha integral em vez de farinha branca 1:1? Pode, mas o resultado fica mais denso; troque 25–50 % e aumente um pouco o líquido.  "}
{"text": "Como medir farinha corretamente? Afofe a farinha com uma colher, coloque no copo medidor sem compactar e nivele com faca.  "}
{"text": "Por que meu brownie ficou seco? Assou demais; retire quando o centro ainda estiver ligeiramente úmido e deixe esfriar na forma.  "}
{"text": "Como selar carne corretamente? Aqueça a panela até soltar fumaça, seque a carne, tempere e sele sem mexer por 2–3 min cada lado.  "}
{"text": "O que é branquear legumes? Cozinhar rapidamente em água fervente e resfriar em gelo para fixar cor e textura.  "}
{"text": "Como fazer um roux para engrossar molhos? Derreta partes iguais de manteiga e farinha, cozinhe 2 min para roux claro ou até dourar para roux escuro.  "}
{"text": "Quando adicionar sal na água do macarrão? Após ferver; a regra é 1 colher (10 g) de sal para cada litro de água.  "}
{"text": "Como evitar que o arroz fique empapado? Lave o arroz até a água ficar clara, use proporção correta (1:2 arroz:água) e fogo baixo após ferver.  "}
{"text": "Qual o ponto certo do risoto? Grãos al dente e caldo ligeiramente cremoso; cerca de 18 min mexendo sempre.  "}
{"text": "Posso fritar com azeite de oliva? Sim, mas use azeite refinado ou fogo médio; azeite extra virgem queima em temperaturas > 190 °C.  "}
{"text": "O que significa deglacear a panela? Soltar os resíduos caramelizados adicionando líquido (vinho, caldo) após selar alimentos.  "}
{"text": "Como temperar frango antes de assar? Seque a pele, esfregue sal e especiarias entre a pele e a carne, e deixe 30 min em temperatura ambiente.  "}
{"text": "Meu peixe gruda na frigideira. Como evitar? Aqueça bem a frigideira, use pouco óleo e só vire quando soltar naturalmente.  "}
{"text": "Não tenho ovos. Como substituir em bolos? Use 1 colher de sopa de linhaça moída + 3 colheres de água para cada ovo (ovo de linhaça).  "}
{"text": "Posso trocar manteiga por óleo no bolo? Sim; use 80 % da quantidade em óleo e reduza um pouco o líquido da receita.  "}
{"text": "O que usar no lugar de creme de leite? Misture leite com manteiga (240 ml leite + 60 g manteiga) ou use leite de coco para versões veganas.  "}
{"text": "Não tenho açúcar mascavo. Posso usar açúcar branco? Pode, mas reduza 1 colher de sopa do total de açúcar e adicione 1 colher de melaço se quiser cor e sabor.  "}
{"text": "Substituto para farinha de trigo em receitas sem glúten? Use mistura 1:1 sem glúten ou combine 60 % farinha de arroz, 40 % polvilho com goma xantana.  "}
{"text": "Como substituir gelatina em receitas veganas? Use ágar-ágar: 1 colher de chá de ágar dissolve em 240 ml de líquido quente.  "}
{"text": "O que posso usar no lugar de leite condensado? Bata 1 xícara de leite em pó, ½ xícara de açúcar e ½ xícara de água quente até engrossar.  "}
{"text": "Não tenho vinho branco para cozinhar. Alternativa? Caldo de legumes com um pouco de vinagre ou suco de limão é bom substituto.  "}
{"text": "Preciso de buttermilk. Como fazer em casa? Adicione 1 colher de sopa de vinagre ou limão a 240 ml de leite e deixe talhar 10 min.  "}
{"text": "Sem farinha de rosca para empanar, o que usar? Use aveia em flocos finos, cereal de milho triturado ou farinha de milho flocada.  "}
{"text": "Quanto tempo dura frango cozido na geladeira? Até 3–4 dias em recipiente hermético a ≤ 4 °C.  "}
{"text": "Posso recongelar carne descongelada? Somente se foi descongelada na geladeira e não ficou > 24 h; a qualidade pode cair.  "}
{"text": "Como saber se um ovo está estragado? Coloque em água: se afundar está bom; se flutuar é velho ou estragado.  "}
{"text": "Quanto tempo posso deixar a massa de pizza fermentando na geladeira? Até 72 h; sabores se desenvolvem melhor entre 24–48 h.  "}
{"text": "Qual a temperatura interna segura para carne bovina? Mínimo 63 °C para malpassado; 71 °C para bem passada.  "}
{"text": "Quanto tempo peixe cru pode ficar em temperatura ambiente? No máximo 2 h (ou 1 h se estiver > 32 °C).  "}
{"text": "Preciso lavar frango antes de cozinhar? Não; lavar espalha bactérias pela pia. Cozinhar mata os micróbios.  "}
{"text": "Como esterilizar potes para geleia? Ferva potes e tampas 10 min, escorra sem secar com pano e use ainda quentes.  "}
{"text": "Por que não devo encher demais a panela de fritura? Baixa a temperatura, aumenta absorção de óleo e alimentos ficam encharcados.  "}
{"text": "Quanto tempo um caldo caseiro dura congelado? Até 3 meses em potes bem vedados.  "}
{"text": "Quantos gramas tem uma xícara de açúcar? Cerca de 200 g, mas varia com o tipo de açúcar.  "}
{"text": "Qual a proporção de arroz para água em arroz integral? Use 1 parte de arroz para 2,5 partes de água.  "}
{"text": "Como converter 350 °F para Celsius? 350 °F equivale a aproximadamente 180 °C.  "}
{"text": "Quantas colheres são 30 ml? Duas colheres de sopa.  "}
{"text": "Uma onça líquida equivale a quantos mililitros? Aproximadamente 30 ml.  "}
{"text": "Preciso de 500 g de farinha, quantas xícaras? Aproximadamente 4 xícaras (125 g cada).  "}
{"text": "Quanto pesa uma colher de sopa de manteiga? Cerca de 15 g.  "}
{"text": "Como medir mel sem grudar? Unte a colher com óleo ou água quente antes de medir.  "}
{"text": "Posso usar colher de chá padrão para fermento? Sim; 1 colher de chá padrão tem 5 ml.  "}
{"text": "O que significa \"qb\" em receitas? \"Quanto baste\"; adicione a quantidade necessária ao seu gosto.  "}
{"text": "Como aumentar proteína em panquecas sem whey? Use farinha de aveia, claras extras e iogurte grego na massa.  "}
{"text": "Sugestão de substituto low‑carb para macarrão? Espaguete de abobrinha ou palmito pupunha em tiras.  "}
{"text": "Posso fazer molho branco sem lactose? Sim; use leite sem lactose ou bebida vegetal + amido de milho.  "}
{"text": "Qual a melhor gordura para dieta cetogênica? Azeite, óleo de coco, manteiga ghee e abacate são opções populares.  "}
{"text": "Veganização de maionese: como fazer? Bata leite de soja frio com óleo e limão até emulsificar; tempere a gosto.  "}
{"text": "Queijo vegano caseiro rápido? Bata castanha de caju demolhada, água, levedura nutricional e ágar em pó aquecido.  "}
{"text": "Quantas calorias tem 100 g de arroz cozido? Cerca de 130 kcal.  "}
{"text": "Como reduzir sódio na sopa pronta? Dilua com água e adicione legumes frescos; use ervas para realçar sabor.  "}
{"text": "Adoçante pode substituir açúcar 1:1? Depende do adoçante; eritritol pode ser 1:1, mas stevia é muito mais doce.  "}
{"text": "Chocolate 70 % cacau é saudável? Tem menos açúcar e mais antioxidantes, mas ainda calórico; consuma com moderação.  "}
{"text": "Posso usar panela de pressão para feijão preto? Sim; após 15 min de pressão, desligue e deixe a pressão sair naturalmente.  "}
{"text": "Airfryer consome menos óleo? Sim; circula ar quente e requer apenas 1 colher ou spray de óleo.  "}
{"text": "Sous‑vide precisa sempre selar depois? Recomendado para criar crosta e desenvolver sabor através da reação de Maillard.  "}
{"text": "Como limpar ferro fundido sem remover a cura? Limpe com água quente e escova, seque e unte levemente com óleo.  "}
{"text": "Qual lâmina do processador usar para massas? Use a lâmina metálica \"S\" para misturar massa de torta ou pão rápido.  "}
{"text": "Instant Pot substitui panela lenta? Sim; use função \"slow cook\" ou pressão para resultados mais rápidos.  "}
{"text": "Termômetro de carne deve ser inserido onde? Na parte mais grossa e longe de ossos para leitura precisa.  "}
{"text": "Como evitar faíscas ao usar micro‑ondas? Não coloque metal e use utensílios próprios para micro‑ondas.  "}
{"text": "Posso colocar papel manteiga na airfryer? Sim, mas fixe-o com comida por cima para não tocar na resistência.  "}
{"text": "Meu liquidificador não tritura gelo bem. O que fazer? Use pulsar, adicione líquido e triture em pequenas porções para não sobreaquece-lo.  "}
{"text": "O que é miso? Pasta fermentada de soja japonesa usada para caldos e temperos.  "}
{"text": "Como fazer guacamole tradicional? Amasse abacate maduro com limão, sal, coentro, cebola roxa e pimenta jalapeño.  "}
{"text": "Qual o tempero principal do curry indiano? Mistura de especiarias, geralmente açafrão‑da‑terra, coentro, cominho e gengibre.  "}
{"text": "Diferença entre sushi e sashimi? Sushi leva arroz temperado; sashimi é apenas peixe cru fatiado.  "}
{"text": "O que acompanha tacos mexicanos autênticos? Tortillas de milho, carne grelhada, cebola, coentro, salsa e limão.  "}
{"text": "Como hidratar couscous marroquino? Cubra com água fervente 1:1, tampe e solte com garfo após 5 min.  "}
{"text": "Quais são os quatro queijos clássicos da pizza quatro queijos? Mozzarella, gorgonzola, parmesão e provolone.  "}
{"text": "O que é chimichurri? Molho argentino de salsa, alho, orégano, vinagre e azeite para carnes.  "}
{"text": "Como fazer molho teriyaki caseiro? Ferva shoyu, açúcar, mirin e gengibre até reduzir, finalize com amido se quiser mais espesso.  "}
{"text": "Qual o ponto da massa no macarrão à carbonara? Al dente; deve resistir levemente à mordida e terminar de cozinhar no molho.  "}
